Repository: artsunique/SyncPress-Fetch-external-WordPress-Posts
Catalog: languages/syncpress-*.po
Languages: de_de

source: How To Use
de_de: Anleitung

source: Follow these instructions to effectively use the SyncPress plugin:
de_de: Befolgen Sie diese Anweisungen, um das SyncPress-Plugin effektiv zu nutzen:

source: Step 1:
de_de: Schritt 1:

source: Navigate to the "Import Posts" tab. Here, input the URL of the WordPress site you wish to import posts from and specify the number of posts to import per page.
de_de: Navigieren Sie zur Registerkarte "Beiträge importieren". Geben Sie hier die URL der WordPress-Website ein, von der Sie Beiträge importieren möchten, und legen Sie die Anzahl der pro Seite zu importierenden Beiträge fest.

source: Step 2:
de_de: Schritt 2:

source: Click on the "Fetch Posts" button. This action initiates the import process, fetching posts from the provided URL.
de_de: Klicken Sie auf den Button "Beiträge abrufen". Diese Aktion startet den Importvorgang und holt Beiträge von der angegebenen URL.

source: Step 3:
de_de: Schritt 3:

source: View the fetched posts under the "Fetched Posts" tab. This tab allows for the review and management of the imported content. You have the option to edit or delete each post individually.
de_de: Sehen Sie sich die abgerufenen Beiträge unter der Registerkarte "Abgerufene Beiträge" an. Diese Registerkarte ermöglicht die Überprüfung und Verwaltung des importierten Inhalts. Sie haben die Möglichkeit, jeden Beitrag einzeln zu bearbeiten oder zu löschen.

source: Step 4:
de_de: Schritt 4:

source: To track and review the history of your imports, go to the "Import History" tab. This section provides details such as the number of posts imported, the date and time of each import, a log of any errors encountered during the import process, and the source URL of the imported posts.
de_de: Um die Historie Ihrer Importe zu verfolgen und zu überprüfen, gehen Sie zur Registerkarte "Importverlauf". Dieser Abschnitt bietet Details wie die Anzahl der importierten Beiträge, Datum und Uhrzeit jedes Imports, ein Protokoll über etwaige Fehler während des Importvorgangs und die Quell-URL der importierten Beiträge.

source: Import History
de_de: Importverlauf

source: No import history found.
de_de: Kein Importverlauf gefunden.

source: Date/Time
de_de: Datum/Uhrzeit

source: Posts
de_de: Beiträge

source: Source
de_de: Quelle

source: Errors
de_de: Fehler

source: Clear History
de_de: Verlauf löschen

source: Import history cleared successfully.
de_de: Importverlauf erfolgreich gelöscht.

source: Posts successfully imported.
de_de: Beiträge erfolgreich importiert.

source: No posts found to import.
de_de: Keine Beiträge zum Importieren gefunden.

source: These posts have already been previously imported.
de_de: Diese Beiträge wurden bereits zuvor importiert.

source: Error in request:
de_de: Fehler in der Anfrage:

source: Action successfully performed.
de_de: Aktion erfolgreich durchgeführt.

source: All fetched posts deleted successfully.
de_de: Alle abgerufenen Beiträge erfolgreich gelöscht.

source: None
de_de: Keine

source: Title
de_de: Titel

source: Label No import history found
de_de: Import Verlauf

source: >No fetched posts found.
de_de: Nichts zum fetchen gefunden.

source: Action
de_de: Aktion

source: Delete All Posts
de_de: Alle Posts entfernen

source: Start importing Posts
de_de: Import Posts starten

source: Error white importing posts.
de_de: Fehler beim Import der Posts.

source: Post successfully imported.
de_de: 'Posts wurden erfolgreich importiert.

source: Site URL
de_de: Seiten URL

source: Number of Posts
de_de: Anzahl der Posts

source: Import into
de_de: Ziel

source: Action successfully done.
de_de: Aktion erfolgreich durchgeführt.
